app/Controllers/Noticias.php

    public function index() {
        $noticiasModel = new NoticiasModel();
        $resultado = $noticiasModel->findAll();
---
SELECT *
FROM `noticias`

    public function mostrar()
    {
        $noticiasModel = new NoticiasModel();
        $resultado = $noticiasModel->findAll();
---
SELECT *
FROM `noticias`

    public function mostrar_noticia($id = null){

        $noticiasModel = new NoticiasModel();
        $data['not'] = $noticiasModel->find($id);
---
SELECT *
FROM `noticias`
WHERE `noticias`.`id` = '12'

    public function editar()
    {
        $noticiasModel = new NoticiasModel();
        $resultado = $noticiasModel->findAll();
---
SELECT *
FROM `noticias`

    public function edit($id = null ){
       if ($id == null) {
            return redirect()->route('noticias');
        }

        $noticiasModel = new NoticiasModel();
        $data['not'] = $noticiasModel->find($id);
---
SELECT *
FROM `noticias`
WHERE `noticias`.`id` = '6'

    public function economia(){
        $noticiasModel = new NoticiasModel();
        $resultado = $noticiasModel->findAll();
---
SELECT *
FROM `noticias`

    public function deporte(){
        $noticiasModel = new NoticiasModel();
        $resultado = $noticiasModel->findAll();
---
SELECT *
FROM `noticias`

    public function validar(){
        $noticiasModel = new NoticiasModel();
        $resultado = $noticiasModel->findAll();
---
SELECT *
FROM `noticias`