app/Controllers/Noticias.php

SELECT *
FROM `noticias`
---
    public function editar(){
        $noticiasModel = new NoticiasModel();
        $resultado = $noticiasModel->findAll();

SELECT *
FROM `noticias`
---
    public function mostrar()
    {
        $noticiasModel = new NoticiasModel();
        $resultado = $noticiasModel->findAll();