app/Models/EditarModel2.php

SELECT `editar2`.*
FROM `editar2`
---
public function mostrarValidar(){
    $builder = $this->db->table('editar2');
    $builder->select('editar2.*');
    return $builder->get()->getResultArray();