app/Models/EditarModel.php

SELECT `editar`.*
FROM `editar`
---
public function mostrarValidar(){
    $builder = $this->db->table('editar');
    $builder->select('editar.*');
    return $builder->get()->getResultArray();

SELECT `editar`.*
FROM `editar`
---
public function mostrarIndex(){
    $builder = $this->db->table('editar');
    $builder->select('editar.*');
    return $builder->get()->getResultArray();