app/Models/NoticiasModel.php

SELECT `noticias`.*
FROM `noticias`
---
public function mostrarValidar(){
    $builder = $this->db->table('noticias');
    $builder->select('noticias.*');
    return $builder->get()->getResultArray();

SELECT `noticias`.*
FROM `noticias`
---
public function mostrarIndex(){
    $builder = $this->db->table('noticias');
    $builder->select('noticias.*');
    return $builder->get()->getResultArray();